In [13]:
import pandas as pd

In [14]:
data = """Gender:smoker, day_time, size
Female|No, Sun, Dinner, 2
Male, No|Sun:Dinner, 3
Male, No:Sun, Dinner, 3
Male|No, Sun_Dinner, 2
Female_No, Sun, Dinner, 4
Male, No:Sun, Dinner, 4"""

In [15]:
with open("sample.csv", "w") as file:   # to write data into a file
    file.write(data)

In [16]:
print(data)

Gender:smoker, day_time, size
Female|No, Sun, Dinner, 2
Male, No|Sun:Dinner, 3
Male, No:Sun, Dinner, 3
Male|No, Sun_Dinner, 2
Female_No, Sun, Dinner, 4
Male, No:Sun, Dinner, 4

In [22]:
df = pd.read_csv('sample.csv',    # to separte dataFrame into columns
                 sep='[:, |_]',  
                 engine='python')  
df

       Gender smoker Unnamed: 2     day    time  Unnamed: 5  size
Female     No    NaN        Sun     NaN  Dinner         NaN   2.0
Male      NaN     No        Sun  Dinner     NaN         3.0   NaN
Male      NaN     No        Sun     NaN  Dinner         NaN   3.0
Male       No    NaN        Sun  Dinner     NaN         2.0   NaN
Female     No    NaN        Sun     NaN  Dinner         NaN   4.0
Male      NaN     No        Sun     NaN  Dinner         NaN   4.0

In [30]:
df = pd.read_csv('people_data.csv', nrows=5) # how many rows to print
df

,First Name,Last Name,Gender,Email,Date of birth,Job Title
0,Shelby,Terrell,Male,elijah57@example.net,1945-10-26,Games developer
1,Phillip,Summers,Female,bethany14@example.com,1910-03-24,Phytotherapist
2,Kristine,Travis,Male,bthompson@example.com,1992-07-02,Homeopath
3,Yesenia,Martinez,Male,kaitlinkaiser@example.com,2017-08-03,Market researcher
4,Lori,Todd,Male,buchananmanuel@example.net,1938-12-01,Veterinary surgeon

In [33]:
df= pd.read_csv("people_data.csv")   #  Using skiprows in read_csv()
print("Previous Dataset: ")
print(df)

df = pd.read_csv("people_data.csv", skiprows = [4,5])
print("Dataset After skipping rows: ")
print(df)

Previous Dataset:
  First Name Last Name  Gender                       Email Date of birth  \
0     Shelby   Terrell    Male        elijah57@example.net    1945-10-26
1    Phillip   Summers  Female       bethany14@example.com    1910-03-24
2   Kristine    Travis    Male       bthompson@example.com    1992-07-02
3    Yesenia  Martinez    Male   kaitlinkaiser@example.com    2017-08-03
4       Lori      Todd    Male  buchananmanuel@example.net    1938-12-01

            Job Title
0     Games developer
1      Phytotherapist
2           Homeopath
3   Market researcher
4  Veterinary surgeon
Dataset After skipping rows:
  First Name Last Name  Gender                  Email Date of birth  \
0     Shelby   Terrell    Male   elijah57@example.net    1945-10-26
1    Phillip   Summers  Female  bethany14@example.com    1910-03-24
2   Kristine    Travis    Male  bthompson@example.com    1992-07-02

         Job Title
0  Games developer
1   Phytotherapist
2        Homeopath

In [35]:
df = pd.read_csv("people_data.csv", parse_dates=["Date of birth"])
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   First Name     5 non-null      object
 1   Last Name      5 non-null      object
 2   Gender         5 non-null      object
 3   Email          5 non-null      object
 4   Date of birth  5 non-null      datetime64[ns]
 5   Job Title      5 non-null      object
dtypes: datetime64[ns](1), object(5)
memory usage: 372.0+ bytes
None